#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # workos_organization.example will be created
  + resource "workos_organization" "example" {
      + allow_profiles_outside_organization = (known after apply)
      + created_at                          = (known after apply)
      + domains                             = [
          + "provided-org.org",
          + "provided-org.ua",
        ]
      + id                                  = (known after apply)
      + name                                = "Provided Org by Terraform"
      + updated_at                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + example_organizations = {
      + allow_profiles_outside_organization = (known after apply)
      + created_at                          = (known after apply)
      + domains                             = [
          + "provided-org.org",
          + "provided-org.ua",
        ]
      + id                                  = (known after apply)
      + name                                = "Provided Org by Terraform"
      + updated_at                          = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Vellanci, Action: `pull_request`, Working Directory: ``, Workflow: `pr-flow`*